for (let i = 0; i < 14; i++) {
    if (i % 2 === 0) continue; // пропускает четные i
    if (i === 9) break; // прерывает цикл на i=9
    console.log(i); // 0, 1, 3
}
console.log("------------------------------------------------")


for (var i = 0; i < 3; i++) { // var виден извне, лучше применять let
    console.log(i); // 0, 1, 2
}
console.log("------------------------------------------------")
console.log(i); // Ошибка: i is not defined, если i будет let и i = 2 если var. 
console.log("------------------------------------------------")

/* Тело цикла может быть пустым, если всё делается в шаге или условии */
for (let i = 0; i < 5; console.log("Count: " + i++)) {} // 0, 1, 2, 3, 4
console.log("------------------------------------------------")

/* Множественный перебор */
for (let i = 0, j = 10; i < 5; i++, j--) {
    console.log("Count i = " + i + ", count j = " + j); // 0 10, 1 9, 2 8, 3 7, 4 6
}